<?php

namespace Database\Seeders;

use App\Models\Country;
use App\Models\Country\Group;
use Illuminate\Database\Eloquent\Collection;
use Illuminate\Database\Seeder;

class CountriesTableSeeder extends Seeder
{
    public function run()
    {
		$countries = [
            'Россия' => [
                'Россия',
            ],
            'Европа' => [
                'Австрия', 'Белоруссия', 'Дания', 'Албания', 'Бельгия', 'Болгария', 'Исландия', 'Андорра', 'Великобритания', 'Венгрия', 'Латвия', 'БоснияиГерцеговина', 'Германия', 'Молдавия', 'Литва', 'Ватикан', 'Ирландия', 'Польша', 'Норвегия', 'Греция', 'Лихтенштейн', 'Финляндия', 'Испания', 'Люксембург', 'Румыния', 'Эстония', 'Италия', 'Словакия', 'Швеция', 'Нидерланды', 'Чехия', 'Франция', 'Украина', 'Португалия', 'Швейцария', 'Сербия', 'Словения', 'Хорватия', 'Черногория',
            ],
            'Азия' => [
                'Абхазия', 'Азербайджан', 'Армения', 'Бахрейн', 'Вьетнам', 'Грузия', 'Египет', 'Израиль', 'Индия', 'Индонезия', 'Иордания', 'Ирак', 'Иран', 'Йемен', 'Казахстан', 'Кипр', 'Киргизия', 'Китай', 'Гонконг', 'Республика Корея', 'Пакистан', 'Саудовская Аравия', 'Сингапур', 'Таджикистан', 'Таиланд', 'Туркмения', 'Турция', 'Узбекистан', 'Филиппины', 'Япония',
            ],
            'Северная Америка' => [
                'Канада', 'Куба', 'Мексика', 'США'
            ],
            'Южная Америка' => [
                'Аргентина', 'Бразилия', 'Венесуэла', 'Колумбия', 'Парагвай', 'Перу', 'Уругвай', 'Чили', 'Эквадор', 
            ],
            'Океания' => [
                'Австралия', 'Новая зеландия'
            ],
        ];

        $groups = $this->groups(array_keys($countries));

        $countries = collect($countries)
            ->map(fn ($countries, $group) => array_map(function ($country) use ($groups, $group) {
                $capital = $this->getCapitalByCountry($country);

                return [
                    'name' => $country,
                    'group_id' => optional($groups->firstWhere('name', $group))->id,
                    'capital' => $capital['capital'] ?? null,
                    'geo_lat' => $capital['latitude'] ?? null,
                    'geo_lon' => $capital['longitude'] ?? null,
                ];
            }, $countries)
            )
            ->flatten(1)
            ->toArray();

        Country::insert($countries);
    }

    private function groups(array $groups): Collection
    {
        Group::insert(
            array_map(fn ($item) => ['name' => $item], $groups)
        );

        return Group::get();
    }

    private function getCapitalByCountry(string $country): ?array
    {
        $capitals = [
            'Россия' => [
                'capital' => 'Москва',
                'latitude' => 55.75396,
                'longitude' => 37.620393,
            ],
			'Австрия' => [
                'capital' => 'Вена',
                'latitude' => 48.2083537,
                'longitude' => 16.3725042,
            ],
			'Белоруссия' => [
                'capital' => 'Минск',
                'latitude' => 53.9024716,
                'longitude' => 27.5618225,
            ],
			'Дания' => [
                'capital' => 'Коппенгаген',
                'latitude' => 55.6867243,
                'longitude' => 12.5700724,
            ],
			'Албания' => [
                'capital' => 'Тирана',
                'latitude' => 41.3281482,
                'longitude' => 19.8184435,
            ],
			'Бельгия' => [
                'capital' => 'Брюссель',
                'latitude' => 50.8465573,
                'longitude' => 4.351697,
            ],
			'Болгария' => [
                'capital' => 'София',
                'latitude' => 42.6978634,
                'longitude' => 23.3221789,
            ],
			'Исландия' => [
                'capital' => 'Рейкявик',
                'latitude' => 64.145981,
                'longitude' => -21.9422367,
            ],
			'Андорра' => [
                'capital' => 'Андорра-ла-Велла',
                'latitude' => 42.5407167,
                'longitude' => 1.5732033,
            ],
			'Великобритания' => [
                'capital' => 'Лондон',
                'latitude' => 51.4893335,
                'longitude' => -0.14405508452768728,
            ],
			'Венгрия' => [
                'capital' => 'Будапешт',
                'latitude' => 47.48138955,
                'longitude' => 19.14609412,
            ],
			'Латвия' => [
                'capital' => 'Рига',
                'latitude' => 56.9493977,
                'longitude' => 24.1051846,
            ],
			'БоснияиГерцеговина' => [
                'capital' => 'Сараево',
                'latitude' => 43.8519774,
                'longitude' => 18.3866868,
            ],
			'Германия' => [
                'capital' => 'Берлин',
                'latitude' => 52.5170365,
                'longitude' => 13.3888599,
            ],
			'Молдавия' => [
                'capital' => 'Кишенев',
                'latitude' => 47.0245117,
                'longitude' => 28.8322923,
            ],
			'Литва' => [
                'capital' => 'Вильнюс',
                'latitude' => 54.6870458,
                'longitude' => 25.2829111,
            ],
			'Ватикан' => [
                'capital' => 'Ватикан',
                'latitude' => 41.903411,
                'longitude' => 12.4528527,
            ],
			'Польша' => [
                'capital' => 'Варшава',
                'latitude' => 52.2319581,
                'longitude' => 21.0067249,
            ],
			'Норвегия' => [
                'capital' => 'Осло',
                'latitude' => 59.9133301,
                'longitude' => 10.7389701,
            ],
			'Ирландия' => [
                'capital' => 'Дублин',
                'latitude' => 53.3497645,
                'longitude' => -6.2602732,
            ],
			'Греция' => [
                'capital' => 'Афины',
                'latitude' => 38.9953683,
                'longitude' => 21.9877132,
            ],
			'Лихтенштейн' => [
                'capital' => 'Вадуц',
                'latitude' => 47.1392862,
                'longitude' => 9.5227962,
            ],
			'Финляндия' => [
                'capital' => 'Стокгольм',
                'latitude' => 59.32533135,
                'longitude' => 18.100340839058855,
            ],
			'Испания' => [
                'capital' => 'Мадрид',
                'latitude' => 40.4167047,
                'longitude' => -3.7035825,
            ],
			'Люксембург' => [
                'capital' => 'Люксембург',
                'latitude' => 49.6112768,
                'longitude' => 6.129799,
            ],
			'Румыния' => [
                'capital' => 'Бухарест',
                'latitude' => 44.4361414,
                'longitude' => 26.1027202,
            ],
			'Эстония' => [
                'capital' => 'Таллин',
                'latitude' => 59.4372155,
                'longitude' => 24.7453688,
            ],
			'Италия' => [
                'capital' => 'Рим',
                'latitude' => 41.8933203,
                'longitude' => 12.4829321,
            ],
			'Словакия' => [
                'capital' => 'Братислава',
                'latitude' => 48.15926025,
                'longitude' => 17.13965869,
            ],
			'Швеция' => [
                'capital' => 'Стокгольм',
                'latitude' => 59.3251172,
                'longitude' => 18.0710935,
            ],
			'Нидерланды' => [
                'capital' => 'Роттердам',
                'latitude' => 51.9244424,
                'longitude' => 4.47775,
            ],
			'Чехия' => [
                'capital' => 'Прага',
                'latitude' => 50.0782945,
                'longitude' => 14.4250488,
            ],
			'Франция' => [
                'capital' => 'Париж',
                'latitude' => 48.8534951,
                'longitude' => 2.3483915,
            ],
			'Украина' => [
                'capital' => 'Киев',
                'latitude' => 50.4295179,
                'longitude' => 30.541992,
            ],
			'Португалия' => [
                'capital' => 'Лиссабон',
                'latitude' => 38.6511983,
                'longitude' => -9.15161132,
            ],
			'Швейцария' => [
                'capital' => 'Цюрих',
                'latitude' => 46.9482713,
                'longitude' => 7.4514512,
            ],
			'Сербия' => [
                'capital' => 'Белград',
                'latitude' => 44.8178131,
                'longitude' => 20.4568974,
            ],
			'Словения' => [
                'capital' => 'Любляна',
                'latitude' => 46.0500268,
                'longitude' => 14.5069289,
            ],
			'Хорватия' => [
                'capital' => 'Загреб',
                'latitude' => 45.8131847,
                'longitude' => 15.9771774,
            ],
			'Черногория' => [
                'capital' => 'Подгорица',
                'latitude' => 42.4415238,
                'longitude' => 19.2621081,
            ],
			'Абхазия' => [
                'capital' => 'Сухуми',
                'latitude' => 43.0033629,
                'longitude' => 41.0192741,
            ],
			'Азербайджан' => [
                'capital' => 'Баку',
                'latitude' => 40.3754434,
                'longitude' => 49.8326748,
            ],
			'Армения' => [
                'capital' => 'Ереван',
                'latitude' => 40.15788524950653,
                'longitude' => 44.50561523437501,
            ],
			'Бахрейн' => [
                'capital' => 'Манама',
                'latitude' => 26.07652055985697,
                'longitude' => 50.537109375,
            ],
			'Вьетнам' => [
                'capital' => 'Ханой',
                'latitude' => 12.629618030174845,
                'longitude' => 108.028564453125,
            ],
			'Грузия' => [
                'capital' => 'Тбилиси',
                'latitude' => 41.672911819602085,
                'longitude' => 44.79125976562501,
            ],
			'Египет' => [
                'capital' => 'Каир',
                'latitude' => 29.878755346037977,
                'longitude' => 31.289062500000004,
            ],
			'Израиль' => [
                'capital' => 'Иерусалим',
                'latitude' => 31.75619625757135,
                'longitude' => 35.23315429687501,
            ],
			'Индия' => [
                'capital' => 'Дели',
                'latitude' => 26.58852714730864,
                'longitude' => 77.16796875000001,
            ],
			'Индонезия' => [
                'capital' => 'Джакарта',
                'latitude' => -6.402648405963884,
                'longitude' => 106.83105468750001,
            ],
			'Иордания' => [
                'capital' => 'Амман',
                'latitude' => 33.87041555094183,
                'longitude' => 35.46386718750001,
            ],
			'Ирак' => [
                'capital' => 'Багдад',
                'latitude' => 32.47269502206151,
                'longitude' => 44.384765625,
            ],
			'Иран' => [
                'capital' => 'Тегеран',
                'latitude' => 35.585851593232356,
                'longitude' => 51.43798828125,
            ],
			'Йемен' => [
                'capital' => 'Сана',
                'latitude' => 15.284185114076445,
                'longitude' => 44.03320312500001,
            ],
			'Казахстан' => [
                'capital' => 'Астана',
                'latitude' => 51.04139389812637,
                'longitude' => 71.41113281250001,
            ],
			'Кипр' => [
                'capital' => 'Никосия',
                'latitude' => 35.10193405724608,
                'longitude' => 33.31054687500001,
            ],
			'Киргизия' => [
                'capital' => 'Бишкек',
                'latitude' => 42.8115217450979,
                'longitude' => 74.53125000000001,
            ],
			'Китай' => [
                'capital' => 'Пекин',
                'latitude' => 38.89103282648846,
                'longitude' => 116.89453125000001,
            ],
			'Гонконг' => [
                'capital' => 'Гонконг',
                'latitude' => 24.44714958973082,
                'longitude' => 121.20117187500001,
            ],
			'Республика Корея' => [
                'capital' => 'Сеул',
                'latitude' => 37.43997405227057,
                'longitude' => 126.91406250000001,
            ],
			'Пакистан' => [
                'capital' => 'Исламабад',
                'latitude' => 33.43144133557529,
                'longitude' => 72.86132812500001,
            ],
			'Саудовская Аравия' => [
                'capital' => 'Мекка',
                'latitude' => 24.5271348225978,
                'longitude' => 46.71386718750001,
            ],
			'Сингапур' => [
                'capital' => 'Сингапур',
                'latitude' => 0.9447814006874024,
                'longitude' => 104.39208984375001,
            ],
			'Таджикистан' => [
                'capital' => 'Душанбе',
                'latitude' => 38.59970036588819,
                'longitude' => 68.81835937500001,
            ],
			'Таиланд' => [
                'capital' => 'Бангкок',
                'latitude' => 13.66733825965496,
                'longitude' => 100.56884765625001,
            ],
			'Туркмения' => [
                'capital' => 'Ашхабад',
                'latitude' => 37.89219554724437,
                'longitude' => 58.40332031250001,
            ],
			'Турция' => [
                'capital' => 'Анкара',
                'latitude' => 40.91351257612758,
                'longitude' => 29.091796875,
            ],
			'Узбекистан' => [
                'capital' => 'Ташкент',
                'latitude' => 41.343824581185714,
                'longitude' => 69.30175781250001,
            ],
			'Филиппины' => [
                'capital' => 'Манила',
                'latitude' => 14.519780046326085,
                'longitude' => 121.06933593750001,
            ],
			'Япония' => [
                'capital' => 'Токио',
                'latitude' => 35.53222622770339,
                'longitude' => 139.87792968750003,
            ],
			'Канада' => [
                'capital' => 'Оттава',
                'latitude' => 45.24395342262324,
                'longitude' => 284.32617187500006,
            ],
			'Куба' => [
                'capital' => 'Гавана',
                'latitude' => 22.917922936146045,
                'longitude' => 277.55859375000006,
            ],
			'Мексика' => [
                'capital' => 'Мехико',
                'latitude' => 18.97902595325528,
                'longitude' => 260.94726562500006,
            ],
			'США' => [
                'capital' => 'Вашингтон',
                'latitude' => 38.75408327579141,
                'longitude' => 283.09570312500006,
            ],
			'Аргентина' => [
                'capital' => 'Буэнос-Айрес',
                'latitude' => -34.74161249883172,
                'longitude' => 301.59667968750006,
            ],
			'Бразилия' => [
                'capital' => 'Рио-де-Жанейро',
                'latitude' => -23.160563309048314,
                'longitude' => 316.84570312500006,
            ],
			'Венесуэла' => [
                'capital' => 'Каракас',
                'latitude' => 10.444597722834875,
                'longitude' => 293.11523437500006,
            ],
			'Колумбия' => [
                'capital' => 'Богота',
                'latitude' => 4.5654735507102915,
                'longitude' => 285.86425781250006,
            ],
			'Парагвай' => [
                'capital' => 'Асунсьон',
                'latitude' => 42.4415238,
                'longitude' => 19.2621081,
            ],
			'Перу' => [
                'capital' => 'Лима',
                'latitude' => -11.996338401936226,
                'longitude' => 282.96386718750006,
            ],
			'Уругвай' => [
                'capital' => 'Монтевидео',
                'latitude' => -34.957995310867915,
                'longitude' => 303.75000000000006,
            ],
			'Чили' => [
                'capital' => 'Сантьяго',
                'latitude' => -33.57801474614399,
                'longitude' => 289.37988281250006,
            ],
			'Эквадор' => [
                'capital' => 'Кито',
                'latitude' => -0.4833927027896987,
                'longitude' => 281.29394531250006,
            ],
			'Австралия' => [
                'capital' => 'Сидней',
                'latitude' => 281.29394531250006,
                'longitude' => 151.08398437500003,
            ],
			'Новая зеландия' => [
                'capital' => 'Веллингтон',
                'latitude' => -43.004647127794435,
                'longitude' => 172.35351562500003,
            ],
			
        ];

        return array_key_exists($country, $capitals) ? $capitals[$country] : null;
    }
}
